#  Data Preparation Exercise 

แบบฝึกหัดนี้เป็นแบบฝึกหัดทดสอบทักษะการเตรียมข้อมูล โดยให้ทำตามคำสั่ง ต่อไปนี้

---

**Import pandas and numpy**

In [189]:
import pandas as pd
import numpy as np

np.zeros()

Docstring:
zeros(shape, dtype=float, order='C', *, like=None)

Return a new array of given shape and type, filled with zeros.

Parameters
----------
shape : int or tuple of ints
    Shape of the new array, e.g., ``(2, 3)`` or ``2``.
dtype : data-type, optional
    The desired data-type for the array, e.g., `numpy.int8`.  Default is
    `numpy.float64`.
order : {'C', 'F'}, optional, default: 'C'
    Whether to store multi-dimensional data in row-major
    (C-style) or column-major (Fortran-style) order in
    memory.
like : array_like, optional
    Reference object to allow the creation of arrays which are not
    NumPy arrays. If an array-like passed in as ``like`` supports
    the ``__array_function__`` protocol, the result will be defined
    by it. In this case, it ensures the creation of an array object
    compatible with that passed in via this argument.

    .. versionadded:: 1.20.0

Returns
-------
out : ndarray
    Array of zeros with the given shape, dtype, and order.

See Also
--------
zeros_like : Return an array of zeros with shape and type of input.
empty : Return a new uninitialized array.
ones : Return a new array setting values to one.
full : Return a new array of given shape filled with value.

Examples
--------
>>> np.zeros(5)
array([ 0.,  0.,  0.,  0.,  0.])

>>> np.zeros((5,), dtype=int)
array([0, 0, 0, 0, 0])

>>> np.zeros((2, 1))
array([[ 0.],
       [ 0.]])

>>> s = (2,2)
>>> np.zeros(s)
array([[ 0.,  0.],
       [ 0.,  0.]])

>>> np.zeros((2,), dtype=[('x', 'i4'), ('y', 'i4')]) # custom dtype
array([(0, 0), (0, 0)],
      dtype=[('x', '<i4'), ('y', '<i4')])
Type:      builtin_function_or_method

**1. ให้นำข้อมูลจาก Salaries.csv มาตรวจสอบว่าใครบ้างที่ทำงานเป็นตำรวจ แล้วสร้างไฟล์ .csv เก็บข้อมูลไว้**

In [16]:
sal = pd.read_csv('Salaries (1).csv')

In [17]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [18]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [36]:
df = sal[sal['JobTitle'].apply(lambda x: 'police' in x.lower())]
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
11,12,PATRICIA JACKSON,CAPTAIN III (POLICE DEPARTMENT),99722.00,87082.62,110804.30,NaN,297608.92,297608.92,2011,NaN,San Francisco,NaN
15,16,RICHARD CORRIEA,"COMMANDER III, (POLICE DEPARTMENT)",198778.01,73478.20,13957.65,NaN,286213.86,286213.86,2011,NaN,San Francisco,NaN
25,26,GREGORY SUHR,CHIEF OF POLICE,256470.41,0.00,11522.18,NaN,267992.59,267992.59,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148312,148313,Jerome J Alamil,Police Officer,309.90,0.00,0.00,64.52,309.90,374.42,2014,NaN,San Francisco,NaN
148409,148410,Dennis V Cravalho,Police Officer,0.00,0.00,242.66,0.00,242.66,242.66,2014,NaN,San Francisco,NaN
148437,148438,Elizabeth A Maron,Police Officer 3,0.00,0.00,212.39,0.00,212.39,212.39,2014,NaN,San Francisco,NaN
148506,148507,Patricia O Williams,Community Police Services Aide,0.00,0.00,134.78,0.00,134.78,134.78,2014,NaN,San Francisco,NaN
148561,148562,Marshall Robles,Community Police Services Aide,0.00,0.00,59.59,10.78,59.59,70.37,2014,NaN,San Francisco,NaN

In [37]:
df.to_csv('Police.csv',index = False)

**2. ให้นำข้อมูลจาก sale_quarterly1.xlsx มาสร้าง Pivot Table เพื่อแสดง ยอดขายเฉลี่ยของพนักงานในแต่ละควอเตอร์**

In [61]:
sal2 = pd.read_excel('sale_quarterly1.xlsx',usecols = 'b:e',header = 2)

In [64]:
sal2

      Employee  Sales  Quarter  Country
0        ณิแนน   1000        1       US
1   กอบเกียรติ    300        1  ญี่ปุ่น
2         Tina    400        1      ไทย
3        Maria    500        1       UK
4         Bill    800        1       US
5        ณิแนน   1000        2      ไทย
6   กอบเกียรติ    500        2  ญี่ปุ่น
7         Tina    700        2      ไทย
8        Maria     50        2       US
9         Bill     60        2       US
10       ณิแนน   1000        3       US
11  กอบเกียรติ    900        3  ญี่ปุ่น
12        Tina    750        3      ไทย
13       Maria    200        3       UK
14        Bill    300        3      ไทย
15       ณิแนน   1000        4  ญี่ปุ่น
16  กอบเกียรติ    900        4  ญี่ปุ่น
17        Tina    250        4      ไทย
18       Maria    750        4       UK
19        Bill     50        4       US

In [83]:
sal2.pivot_table(index = 'Employee',columns = 'Quarter',values = 'Sales', aggfunc = 'mean', fill_value = 0)

Quarter          1       2       3       4
Employee
Bill         800.0    60.0   300.0    50.0
Maria        500.0    50.0   200.0   750.0
Tina         400.0   700.0   750.0   250.0
กอบเกียรติ   300.0   500.0   900.0   900.0
ณิแนน       1000.0  1000.0  1000.0  1000.0

**3. ให้นำข้อมูลจาก data_clean_bfclean.csv คอลัมน์ SQ_M มาจัดการ**

โดยที่
- ข้อมูลที่มีค่าน้อยกว่า 100 ถือว่าเป็นข้อมูลที่ผิดพลาด ให้เปลี่ยนเป็น Null
- ข้อมูลที่ไม่ใช่ตัวเลขถือเป็นข้อมูลที่ผิดพลาด ให้เปลี่ยนเป็น Null
- ทำคอลัมน์ให้เป็น float64

In [179]:
dc = pd.read_csv('data_clean_bfclean.csv')
dc

      PID  ST_NUM  ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_M
0     กอบ   104.0   PUTNAM            Y           3.0        1   1000
1     แนน   197.0    LETON            n           3.0        1     --
2     Lam     NaN    LETON            N           NaN        1    850
3   Ninan   201.0    BEREY            N           1.0       -2  700.5
4     Nii     NaN    BEREY            Y           2.0     2ABC   1600
5     Tom   207.0    BEREY            Y           3.0      1.5  800.8
6   Green     NaN   WAGTON          NaN           2.0        3    950
7   Shasa   213.0  TREMONT            Y           1.0        1    NaN
8   Alisa   215.0  TREMONT            Y           2.0        2   1800
9     Ksb   216.0  TREMONT            n           2.0        2   90.5
10    Jib   217.0  TREMONT           12           2.0        2   70.2

In [154]:
dc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PID           11 non-null     object
 1   ST_NUM        8 non-null      float64
 2   ST_NAME       11 non-null     object
 3   OWN_OCCUPIED  10 non-null     object
 4   NUM_BEDROOMS  10 non-null     float64
 5   NUM_BATH      11 non-null     object
 6   SQ_M          10 non-null     object
dtypes: float64(2), object(5)
memory usage: 748.0+ bytes

In [176]:
def fn(x):
    try:
        val = float(x)
        if val <100:
            return np.nan
        else: return val
    except:
        return np.nan
dc['SQ_M'] = dc['SQ_M'].apply(fn)

In [177]:
dc

      PID  ST_NUM  ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH    SQ_M
0     กอบ   104.0   PUTNAM            Y           3.0        1  1000.0
1     แนน   197.0    LETON            n           3.0        1     NaN
2     Lam     NaN    LETON            N           NaN        1   850.0
3   Ninan   201.0    BEREY            N           1.0       -2   700.5
4     Nii     NaN    BEREY            Y           2.0     2ABC  1600.0
5     Tom   207.0    BEREY            Y           3.0      1.5   800.8
6   Green     NaN   WAGTON          NaN           2.0        3   950.0
7   Shasa   213.0  TREMONT            Y           1.0        1     NaN
8   Alisa   215.0  TREMONT            Y           2.0        2  1800.0
9     Ksb   216.0  TREMONT            n           2.0        2     NaN
10    Jib   217.0  TREMONT           12           2.0        2     NaN

In [180]:
dc

      PID  ST_NUM  ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_M
0     กอบ   104.0   PUTNAM            Y           3.0        1   1000
1     แนน   197.0    LETON            n           3.0        1     --
2     Lam     NaN    LETON            N           NaN        1    850
3   Ninan   201.0    BEREY            N           1.0       -2  700.5
4     Nii     NaN    BEREY            Y           2.0     2ABC   1600
5     Tom   207.0    BEREY            Y           3.0      1.5  800.8
6   Green     NaN   WAGTON          NaN           2.0        3    950
7   Shasa   213.0  TREMONT            Y           1.0        1    NaN
8   Alisa   215.0  TREMONT            Y           2.0        2   1800
9     Ksb   216.0  TREMONT            n           2.0        2   90.5
10    Jib   217.0  TREMONT           12           2.0        2   70.2

In [182]:
def fn(x):
    try:
        val = float(x)
        if val <100:
            return np.nan
        else: 
            return val
    except:
        return np.nan
        
dc['SQ_M'] = dc['SQ_M'].apply(fn).astype("Float64", errors="ignore")
dc

      PID  ST_NUM  ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH    SQ_M
0     กอบ   104.0   PUTNAM            Y           3.0        1  1000.0
1     แนน   197.0    LETON            n           3.0        1    <NA>
2     Lam     NaN    LETON            N           NaN        1   850.0
3   Ninan   201.0    BEREY            N           1.0       -2   700.5
4     Nii     NaN    BEREY            Y           2.0     2ABC  1600.0
5     Tom   207.0    BEREY            Y           3.0      1.5   800.8
6   Green     NaN   WAGTON          NaN           2.0        3   950.0
7   Shasa   213.0  TREMONT            Y           1.0        1    <NA>
8   Alisa   215.0  TREMONT            Y           2.0        2  1800.0
9     Ksb   216.0  TREMONT            n           2.0        2    <NA>
10    Jib   217.0  TREMONT           12           2.0        2    <NA>